---
kind: type
id: T:Autodesk.Revit.UI.DoubleClickOptions
source: html/910f7cb7-9027-ed13-8502-2bfb9c347aee.htm
---
# Autodesk.Revit.UI.DoubleClickOptions

Provides access to settings that control what happens when the current user double-clicks on an element.

## Syntax (C#)
```csharp
public class DoubleClickOptions : IDisposable
```

## Remarks
These settings are stored on a per-user basis. Revit will follow these settings for all projects and families for this user.